Revit 2027 API
RelinquishOptions Constructor
 Constructs a new instance of RelinquishOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RelinquishOptions(
	bool relinquishEverything
)
Public Sub New (
	relinquishEverything As Boolean
)
public:
RelinquishOptions(
	bool relinquishEverything
)
new :
        relinquishEverything : bool -> RelinquishOptions
Parameters
relinquishEverything Boolean
 The value to apply to all of the members.
See Also
Reference
RelinquishOptions Class
Autodesk.Revit.DB Namespace